app/views/users/show.html.erb

<h3>Your Reviews</h3>
<% if @user.reviews.empty? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

<% else %>
    <% @user.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]