app/helpers/reviews_helper.rb

    def editable_reviews(restaurant, user=current_user)
        restaurant.reviews.select {|review| review.user == user}
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]