app/views/restaurants/edit.html.erb

    <%= render partial: "form", locals: {f: f} %>
    <% @restaurant.days_sorted.each do |day| %>
---
SELECT "days".* FROM "days" WHERE "days"."restaurant_id" = ?  [["restaurant_id", 1]]