app/views/restaurants/show.html.erb

SELECT "days".* FROM "days" WHERE "days"."restaurant_id" = ?  [["restaurant_id", 2]]
---
<table>
<% @restaurant.days_sorted.each do |day| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 2]]
---
<h3>Reviews</h3>
<% @restaurant.reviews.each do |review| %>