app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
SELECT 1 AS one FROM "restaurants" WHERE "restaurants"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
INSERT INTO "restaurants" ("name", "address", "carryout", "outdoor_dining", "indoor_dining", "follows_rules", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        diner = Restaurant.new(restaurant_params)
        if Restaurant.all.any? {|restaurant| restaurant.name == diner.name}
            flash[:notice] = "Restaurant name taken. Please choose another."
            diner = nil
        else
            diner.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "restaurants" SET "follows_rules" = ?, "author_id" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["follows_rules", 1], ["author_id", 1], ["updated_at", "2020-10-17 09:30:06.046338"], ["id", 8]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def update
        diner = Restaurant.find(params[:id])
        diner.update(restaurant_params)
        if diner
            redirect_to restaurant_path(diner)
        else
            flash[:notice] = "Error. Please reenter information."
            redirect_to edit_restaurant_path(Restaurant.find(params[:id]))

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 12]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 5]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 3]]
DELETE FROM "days" WHERE "days"."id" = ?  [["id", 29]]
SELECT "days".* FROM "days" WHERE "days"."restaurant_id" = ?  [["restaurant_id", 5]]
---
    def destroy
        diner = Restaurant.find(params[:id])
        diner.reviews.each {|review| review.destroy}
        diner.days.each {|day| day.destroy}