app/controllers/restaurants_controller.rb

    def destroy
        diner = Restaurant.find(params[:id])
        diner.reviews.each {|review| review.destroy}
        diner.days.each {|day| day.destroy}
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ? AND "reviews"."id" = ?  [["restaurant_id", 1], ["id", 1]]
SELECT "days".* FROM "days" WHERE "days"."restaurant_id" = ? AND "days"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["restaurant_id", 1], ["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]