app/controllers/reviews_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "reviews" ON "users"."id" = "reviews"."user_id" WHERE "reviews"."restaurant_id" = ? AND "users"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        diner = Restaurant.find(params[:restaurant_id])
        if diner.users.include?(current_user) && !current_user.admin
            first_review = diner.reviews.select {|review| review.user == current_user}.first

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ? AND "reviews"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def edit
        if params[:restaurant_id]
            restaurant = Restaurant.find_by(id: params[:restaurant_id])
            if restaurant
                @review = restaurant.reviews.find_by(id: params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("content", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "No good! Should be open more!"], ["rating", 2], ["user_id", 2], ["restaurant_id", 1], ["created_at", "2020-10-13 08:49:07.115450"], ["updated_at", "2020-10-13 08:49:07.115450"]]
---
    def create
        diner = Restaurant.find(review_params[:restaurant_id])
        review = Review.create(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Restaurant no good! Should be open more!"], ["updated_at", "2020-10-13 09:11:38.884546"], ["id", 8]]
---
    def update
        review = Review.find(params[:id])
        review.update(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 13]]
---
    def destroy
        review = Review.find(params[:id])
        diner = Restaurant.find(params[:restaurant_id])
        review.destroy