app/controllers/sessions_controller.rb

    def create
        @user = User.find_by(user_name: params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "smurphy"], ["LIMIT", 1]]

    def facebook_create
        user = User.find_or_create_by(uid: auth['uid'])
        user.facebook = true
        user.user_name = auth['info']['name']
        user.email = auth['info']['email']
        user.image = auth['info']['image']
        user.password = "test"
        user.save
---
INSERT INTO "users" ("user_name", "email", "password_digest", "created_at", "updated_at", "image", "uid", "facebook") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "179947197005780"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$ltb2NA880Egyw4qiwutLJO7Sir4PPDtE.6UbSeiBQS7QkTXO2zYz2"], ["updated_at", "2020-11-22 21:47:53.636190"], ["id", 7]]