app/controllers/users_controller.rb

    def index
        unless current_user.admin
            return head(:forbidden)
        end
        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if User.all.any? {|account| account.user_name == user.user_name}
            flash[:notice] = "User name taken. Please choose another."
            user = nil
        elsif User.all.any? {|account| account.email == user.email}
            flash[:notice] = "Email taken. Please choose another."
            user = nil
        else
            user.save
---
SELECT "users".* FROM "users"
SELECT 1 AS one FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "test_account"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "babelfish"], ["LIMIT", 1]]
INSERT INTO "users" ("user_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$Q40FvjGq9U9DSr12xA7Q0e2o1nevcsnxYac9PMBgvZ9ZJdE9U5mzC"], ["updated_at", "2020-10-31 05:44:15.119730"], ["id", 6]]

    def destroy
        user = User.find(params[:id])
        session.delete :user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

    def admin_update
        User.all.each do |user|
            if params[:users].include?(user.id.to_s)
                user.admin = true
            else
                user.admin = false
            end
            user.save
---
SELECT "users".* FROM "users"
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 1], ["updated_at", "2020-12-02 21:29:05.237187"], ["id", 2]]