app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$a7cd5tFI76dn/KQV6QBNU.ic/dwGnU.KG9J8GxVtr/Tpd/itWof0q"], ["updated_at", "2020-09-10 23:54:03.141699"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
        user = User.find(params[:id])
        session.delete :user_id