app/models/restaurant.rb

    def average_rating
        arr = self.reviews.collect {|review| review.rating}
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]

    def all_days_closed
        if self.days.all? {|day| day.closed}
---
SELECT "days".* FROM "days" WHERE "days"."restaurant_id" = ?  [["restaurant_id", 1]]